_posts/2016-06-20-Linux文本处理工具.html
---
title: "Linux文本处理工具"
date: 2016-06-04
layout: post
categories: 
- 文本处理
tags: 
- Linux 
- Bash
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. cat, tac</a></li>
<li><a href="#orgheadline2">2. more, less</a></li>
<li><a href="#orgheadline3">3. head, tail</a></li>
<li><a href="#orgheadline4">4. tr</a></li>
<li><a href="#orgheadline5">5. wc</a></li>
<li><a href="#orgheadline6">6. cut(df)</a></li>
<li><a href="#orgheadline7">7. sort(tk)</a></li>
<li><a href="#orgheadline8">8. uniq</a></li>
<li><a href="#orgheadline14">9. diff/patch</a>
<ul>
<li><a href="#orgheadline9">diff</a>
<ul>
<li><a href="#orgheadline10">正常格式的diff</a></li>
<li><a href="#orgheadline11">上下文格式的diff</a></li>
<li><a href="#orgheadline12">合并格式的diff</a></li>
</ul>
</li>
<li><a href="#orgheadline13">patch</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> cat, tac</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-yaml">cat [OPTION]... [FILE]...  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36830;&#25509;&#25991;&#20214;&#65292;&#28982;&#21518;&#26174;&#31034;&#21040;&#23631;&#24149;&#19978;</span>
  <span style="color: #FD971F;">-A</span>: &#26174;&#31034;&#25152;&#26377;&#29305;&#27530;&#23383;&#31526;
  <span style="color: #FD971F;">-n</span>: &#23545;&#26174;&#31034;&#30340;&#27599;&#19968;&#34892;&#36827;&#34892;&#32534;&#21495;
</pre>
</div>
<div class="org-src-container">

<pre class="src src-bash">tac <span style="color: #AE81FF;">[</span>OPTION<span style="color: #AE81FF;">]</span>... <span style="color: #AE81FF;">[</span>FILE<span style="color: #AE81FF;">]</span>...  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36830;&#25509;&#25991;&#20214;&#65292;&#28982;&#21518;&#20498;&#36807;&#26469;&#26174;&#31034;&#21040;&#23631;&#24149;&#19978;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> more, less</h2>
<div class="outline-text-2" id="text-2">
<p>
more和less可以对长文章进行翻页，less更常用
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> head, tail</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-yaml">head [OPTION]... [FILE]...  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35835;&#21462;&#25991;&#20214;&#22836;</span>
  <span style="color: #FD971F;">-c num</span>: &#25351;&#23450;&#33719;&#21462;&#21069;num&#23383;&#33410;
  <span style="color: #FD971F;">-n num/-num</span>: &#25351;&#23450;&#33719;&#21462;&#21069;num&#34892;
  <span style="color: #FD971F;">-n -num</span>: &#25490;&#38500;&#21518;num&#34892;
</pre>
</div>
<div class="org-src-container">

<pre class="src src-yaml">tail [OPTION]... [FILE]...  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35835;&#21462;&#25991;&#20214;&#23614;</span>
  <span style="color: #FD971F;">-c num</span>: &#25351;&#23450;&#33719;&#21462;&#21518;num&#23383;&#33410;
  <span style="color: #FD971F;">-n num/-num</span>: &#25351;&#23450;&#33719;&#21462;&#21518;num&#34892;
  <span style="color: #FD971F;">-n +num</span>: &#25490;&#38500;&#31532;num&#34892;&#20043;&#21069;&#30340;&#34892;&#25968;
  <span style="color: #FD971F;">-f</span>: &#36319;&#36394;&#26174;&#31034;&#25991;&#20214;&#26032;&#36861;&#21152;&#30340;&#20869;&#23481;&#65307;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> tr</h2>
<div class="outline-text-2" id="text-4">
<p>
转换或删除字符
</p>
<div class="org-src-container">

<pre class="src src-yaml">tr [OPTION]... SET1 [SET2]
  <span style="color: #FD971F;">-d</span>: &#21024;&#38500;SET1&#20013;&#30340;&#23383;&#31526;(&#40664;&#35748;&#20026;&#36716;&#25442;&#20026;SET2&#23545;&#24212;&#30340;&#23383;&#31526;)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> wc</h2>
<div class="outline-text-2" id="text-5">
<p>
行数 单词 字节
</p>
<div class="org-src-container">

<pre class="src src-yaml">wc [OPTION]... [FILE]...
  <span style="color: #FD971F;">-l</span>: lines
  <span style="color: #FD971F;">-w</span>: words
  <span style="color: #FD971F;">-c</span>: characters
</pre>
</div>
<div class="org-src-container">

<pre class="src src-bash">wc -l FILE | cut -d<span style="color: #E6DB74;">' '</span> -f1  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#32479;&#35745;&#25991;&#20214;&#30340;&#34892;&#25968;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> cut(df)</h2>
<div class="outline-text-2" id="text-6">
<p>
通过分隔符切割后显示指定字段
</p>
<div class="org-src-container">

<pre class="src src-yaml">cut [OPTION]... [FILE]...
  <span style="color: #FD971F;">-d DELIMITER</span>: &#25351;&#23450;&#20998;&#38548;&#31526;(&#40664;&#35748;&#20026;&#21046;&#34920;&#31526;)
  <span style="color: #FD971F;">-f FILEDS</span>: &#25351;&#23450;&#23383;&#27573;&#65292;&#22914; 1-3,7
  <span style="color: #FD971F;">--output-delimiter=STRING</span>: &#25351;&#23450;&#36755;&#20986;&#20998;&#38548;&#31526;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> sort(tk)</h2>
<div class="outline-text-2" id="text-7">
<p>
排序
</p>
<div class="org-src-container">

<pre class="src src-yaml">sort [OPTION]... [FILE]...
  <span style="color: #FD971F;">-f</span>: &#24573;&#30053;&#23383;&#31526;&#22823;&#23567;&#20889;
  <span style="color: #FD971F;">-r</span>: &#36870;&#24207;
  <span style="color: #FD971F;">-t DELIMITER</span>: &#23383;&#27573;&#20998;&#38548;&#31526;
  <span style="color: #FD971F;">-k num</span>: &#20197;&#25351;&#23450;&#23383;&#27573;&#20026;&#26631;&#20934;&#25490;&#24207;
  <span style="color: #FD971F;">-n</span>: &#20197;&#25968;&#20540;&#22823;&#23567;&#36827;&#34892;&#25490;&#24207;
  <span style="color: #FD971F;">-u</span>: uniq&#65292;&#25490;&#24207;&#21518;&#21435;&#37325;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">8</span> uniq</h2>
<div class="outline-text-2" id="text-8">
<p>
去除连续且完全相同的行
</p>
<div class="org-src-container">

<pre class="src src-yaml">uniq [OPTION]... [FILE]...
  <span style="color: #FD971F;">-c</span>: &#26174;&#31034;&#27599;&#34892;&#37325;&#22797;&#20986;&#29616;&#30340;&#27425;&#25968;&#65307;
  <span style="color: #FD971F;">-d</span>: &#20165;&#26174;&#31034;&#37325;&#22797;&#36807;&#30340;&#34892;&#65307;
  <span style="color: #FD971F;">-u</span>: &#20165;&#26174;&#31034;&#19981;&#26366;&#37325;&#22797;&#30340;&#34892;&#65307;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">9</span> diff/patch</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">diff</h3>
<div class="outline-text-3" id="text-orgheadline9">
<p>
diff用于比较两个文本文件的差异
</p>
</div>
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10">正常格式的diff</h4>
<div class="outline-text-4" id="text-orgheadline10">
<div class="org-src-container">

<pre class="src src-bash">diff file1 file2
</pre>
</div>
<p>
显示结果中，第一行是一个提示，用来说明变动位置。它分成三个部分：前面的数字，表示file1的第n行有变化；中间的"c"表示change、"a"表示add、"d"表示delete
</p>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11">上下文格式的diff</h4>
<div class="outline-text-4" id="text-orgheadline11">
<div class="org-src-container">

<pre class="src src-bash">diff -c f1 f2
</pre>
</div>
<p>
结果分成四个部分。第一部分的两行，显示两个文件的基本情况：文件名和时间信息，"<b>*</b>"表示变动前的文件，"&#x2014;"表示变动后的文件。第二部分是15个星号，将文件的基本情况与变动内容分割开。第三部分显示变动前的文件，即file1
</p>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12">合并格式的diff</h4>
<div class="outline-text-4" id="text-orgheadline12">
<div class="org-src-container">

<pre class="src src-bash">diff -u f1 f2
</pre>
</div>
<p>
上下文格式的合并版
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13">patch</h3>
<div class="outline-text-3" id="text-orgheadline13">
<p>
patch用于根据diff产生的差异来对源文件进行打补丁，可对目录进行打补丁
</p>
<div class="org-src-container">

<pre class="src src-bash">patch <span style="color: #AE81FF;">[</span>options<span style="color: #AE81FF;">]</span> <span style="color: #AE81FF;">[</span>originalfile<span style="color: #AE81FF;">]</span> <span style="color: #AE81FF;">[</span>patchfile<span style="color: #AE81FF;">]</span>
</pre>
</div>
</div>
</div>
</div>
